package 模块信息收集;


import static 模块信息收集.Constant.CONFIG_MODULE_CODE;
import static 模块信息收集.Constant.SYSTEM_CODE;

/**
 * 错误码  8位数字表示  [S][M][T][O]
 * [S]:服务名称   2位   云平台(08)
 * [M]:模块名称   2位
 * [T]:错误类型   1位  1-系统错误,2-参数错误,3-依赖基础服务错误,4-业务错误
 * <p>
 * [O]:顺序码     3位
 */
public enum MsgCode {

    MSG_0000("0000", "SUCCESS"),
    MSG_SUCCESS(MSG_0000.getCode(), MSG_0000.getMsg()),
    MSG_9999("9999", "ERROR"),
    MSG_ERROR(MSG_9999.getCode(), MSG_9999.getMsg()),

    /**
     * 系统内部
     */
    MSG_0001("0001", "帐号不能重复"),
    MSG_0002("0002", "用户ID不存在"),
    MSG_0003("0003", "旧密码错误"),
    MSG_0004("0004", "密码不能为空"),
    MSG_0005("0005", "角色ID不存在"),
    MSG_0006("0006", "存在用户关联该角色不能删除"),
    MSG_0007("0007", "权限ID不存在"),
    MSG_0008("0008", "存在角色关联改权限不能删除"),
    MSG_0009("0009", "序列名称不能为空"),
    MSG_0010("0010", "角色未关联该权限,无法回收"),
    MSG_0011("0011", "角色ID不能为空"),
    MSG_0012("0012", "序列增加不能小于1"),
    MSG_0013("0013", "用户角色未关联,无法收回"),
    MSG_0014("0014", "用户ID不能为空"),

    MSG_1001("1001", "用户名或密码错误"),
    MSG_1005("1005", "未登录"),

    /**
     * 消息
     */
    MSG_2001("2001", "请一分钟后再发送验证码！"),
    MSG_2002("2002", "验证码已过期，请重新获取！"),
    MSG_2003("2003", "验证码错误！"),
    MSG_2004("2004", "验证码校验次数太多，请重新获取！"),
    MSG_2005("2005", "发送手机号码不能为空！"),

    /**
     * 签名附件
     */
    MSG_3001("3001", "表单参数不合法"),
    MSG_3002("3002", "记录不存在"),
    MSG_3003("3003", "对象转换异常"),
    MSG_3004("3004", "签名对象不能为空"),
    MSG_3005("3005", "签名失败"),
    MSG_3006("3006", "校验失败"),
    MSG_3007("3007", "未知错误"),
    MSG_3008("3008", "服务超时"),
    MSG_3009("3009", "短信发送失败"),
    MSG_3010("3010", "上传附件过大"),
    MSG_3011("3011", "附件不存在"),
    MSG_3012("3012", "附件无权限查看"),
    MSG_3013("3013", "不支持该附件类型"),
    MSG_3014("3014", "附件源不能为空"),
    MSG_3015("3015", "文件下载异常"),

    /******************************** ===  配置模块 (01) start  === ************************************/

    /**
     * 1-系统错误
     */
    MSG_011000(SYSTEM_CODE + CONFIG_MODULE_CODE + "1000", "系统内部错误，请稍后再试"),
    /**
     * 2-参数错误
     */
    MSG_012000(SYSTEM_CODE + CONFIG_MODULE_CODE + "2000", "模块编号不能为空"),

    /**
     * 3-依赖基础服务错误
     */
    MSG_013000(SYSTEM_CODE + CONFIG_MODULE_CODE + "3000", ""),
    /**
     * 4-业务错误
     */
    MSG_014000(SYSTEM_CODE + CONFIG_MODULE_CODE + "4000", "未找到路由信息"),
    MSG_014001(SYSTEM_CODE + CONFIG_MODULE_CODE + "4001", "路由禁用"),
    MSG_014002(SYSTEM_CODE + CONFIG_MODULE_CODE + "4002", "请求转发连接被拒"),
    MSG_014003(SYSTEM_CODE + CONFIG_MODULE_CODE + "4003", "操作员不能为空或不存在"),


    /******************************** ===  配置模块 (01) start end  === *******************************************/

    /******************************** ===  RBAC 权限管理模块 (98) start  === ************************************/

    /**
     * 1-系统错误
     */
    MSG_981000(SYSTEM_CODE + "981000", "系统内部错误，请稍后再试"),
    /**
     * 2-参数错误
     */
    MSG_982000(SYSTEM_CODE + "982000", "模块内容不能重复"),
    MSG_982001(SYSTEM_CODE + "982001", "模块名称不能为空"),
    MSG_982002(SYSTEM_CODE + "982002", "模块类型不存在"),
    MSG_982003(SYSTEM_CODE + "982003", "父级模块不存在"),
    MSG_982004(SYSTEM_CODE + "982004", "模块内容不能为空"),
    MSG_982005(SYSTEM_CODE + "982005", "模块编号不存在"),
    MSG_982006(SYSTEM_CODE + "982006", "模块ID[%s]不存在"),
    MSG_982007(SYSTEM_CODE + "982007", "岗位编号不存在"),
    MSG_982008(SYSTEM_CODE + "982008", "机构编号不存在"),
    MSG_982009(SYSTEM_CODE + "982009", "机构类型有误"),
    MSG_982010(SYSTEM_CODE + "982010", "角色编号不存在"),
    MSG_982011(SYSTEM_CODE + "982011", "组织已经被添加"),
    MSG_982012(SYSTEM_CODE + "982012", "用户名不能为空"),
    MSG_982013(SYSTEM_CODE + "982013", "小区不可以添加其它组织"),
    MSG_982014(SYSTEM_CODE + "982014", "手机号码不合法"),
    MSG_982015(SYSTEM_CODE + "982015", "电子邮箱不合法"),
    MSG_982016(SYSTEM_CODE + "982016", "岗位已关联用户,无法删除"),
    MSG_982017(SYSTEM_CODE + "982017", "用户ID不存在"),
    MSG_982018(SYSTEM_CODE + "982018", "用户状态有误"),
    MSG_982019(SYSTEM_CODE + "982019", "组织编号不能为空"),
    MSG_982020(SYSTEM_CODE + "982020", "组织名称不能为空"),
    MSG_982021(SYSTEM_CODE + "982021", "组织类型不存在"),
    MSG_982022(SYSTEM_CODE + "982022", "组织父类编号不存在"),
    MSG_982023(SYSTEM_CODE + "982023", "组织子类型不存在"),
    MSG_982024(SYSTEM_CODE + "982024", "组织编号不存在"),
    MSG_982025(SYSTEM_CODE + "982025", "非机构编号"),
    MSG_982026(SYSTEM_CODE + "982026", "模块操作类型有误"),
    MSG_982027(SYSTEM_CODE + "982027", "部门下存在岗位信息,无法删除"),
    MSG_982028(SYSTEM_CODE + "982028", "证件类型有误"),
    MSG_982029(SYSTEM_CODE + "982029", "身份证号码有误"),
    MSG_982030(SYSTEM_CODE + "982030", "性别有误"),
    MSG_982031(SYSTEM_CODE + "982031", "生日有误"),
    MSG_982032(SYSTEM_CODE + "982032", "基础用户信息帐户不存在"),
    MSG_982033(SYSTEM_CODE + "982033", "添加其它组织不存在"),
    MSG_982034(SYSTEM_CODE + "982034", "暂不支持父节点删除"),
    MSG_982035(SYSTEM_CODE + "982035", "排序非正整数"),
    MSG_982036(SYSTEM_CODE + "982036", "模板导入上级内容不能空"),
    MSG_982037(SYSTEM_CODE + "982037", "模板导入上级内容必须有TOP_CODE"),
    MSG_982038(SYSTEM_CODE + "982038", "批量插入异常"),
    MSG_982039(SYSTEM_CODE + "982039", "用户已关联组织"),
    MSG_982040(SYSTEM_CODE + "982040", "机构用户帐号不存在"),
    MSG_982041(SYSTEM_CODE + "982041", "地域编号信息不存在"),
    MSG_982042(SYSTEM_CODE + "982042", "机构明细不存在"),
    MSG_982043(SYSTEM_CODE + "982043", "系统角色不支持修改"),
    MSG_982044(SYSTEM_CODE + "982044", "房屋类型有误"),
    MSG_982045(SYSTEM_CODE + "982045", "导入文件读取失败"),
    MSG_982046(SYSTEM_CODE + "982046", "模块子类型有误"),
    MSG_982047(SYSTEM_CODE + "982047", "楼层编号信息不存在"),
    MSG_982048(SYSTEM_CODE + "982048", "用户信息不存在"),
    MSG_982049(SYSTEM_CODE + "982049", "政治面貌不正确"),
    MSG_982050(SYSTEM_CODE + "982050", "职业分类不正确"),
    MSG_982051(SYSTEM_CODE + "982051", "文化程度不正确"),
    MSG_982052(SYSTEM_CODE + "982052", "机构用户信息已添加"),
    MSG_982053(SYSTEM_CODE + "982053", "角色已添加"),
    MSG_982054(SYSTEM_CODE + "982054", "专有部分座落已绑定业主信息,无法删除"),


    /**
     * 3-依赖基础服务错误
     */
    MSG_983000(SYSTEM_CODE + "983000", ""),
    /**
     * 4-业务错误
     */
    MSG_984000(SYSTEM_CODE + "984000", "模块已关联角色,无法删除"),
    MSG_984001(SYSTEM_CODE + "984001", "角色已关联用户信息,无法删除"),
    MSG_984002(SYSTEM_CODE + "984002", "文件下载异常"),
    MSG_984003(SYSTEM_CODE + "984003", "非小区组织,无法必入楼层信息"),
    MSG_984004(SYSTEM_CODE + "984004", ""),
    MSG_984005(SYSTEM_CODE + "984005", "模块已关联岗位,无法删除"),
    MSG_984006(SYSTEM_CODE + "984006", ""),

    /******************************** ===  RBAC 权限管理模块 (98) end  === *******************************************/


    /******************************** ===  登录模块 (14) start  === ************************************/

    /**
     * 1-系统错误
     */
    MSG_141000(SYSTEM_CODE + "141000", ""),
    /**
     * 2-参数错误
     */
    MSG_142000(SYSTEM_CODE + "142000", "登录凭证不能为空"),
    MSG_142001(SYSTEM_CODE + "142001", "密码不能为空"),
    /**
     * 3-依赖基础服务错误
     */
    MSG_143000(SYSTEM_CODE + "143000", ""),
    /**
     * 4-业务错误
     */
    MSG_144000(SYSTEM_CODE + "144000", "用户未登录"),
    MSG_144001(SYSTEM_CODE + "144001", "登录失败"),
    MSG_144002(SYSTEM_CODE + "144002", "会话重建失败"),
    MSG_144003(SYSTEM_CODE + "144003", "登出失败"),
    MSG_144004(SYSTEM_CODE + "144004", "会话已失效，请重新登录"),
    MSG_144005(SYSTEM_CODE + "144005", "模块未配置，请确认"),
    MSG_144006(SYSTEM_CODE + "144006", "更新用户会话信息失败"),


    /******************************** ===  登录模块模块 end  === *******************************************/

    /******************************** ===  文件模块 (15) start  === ************************************/

    /**
     * 1-系统错误
     */
    MSG_151000(SYSTEM_CODE + "151000", "图片上传失败"),
    MSG_151001(SYSTEM_CODE + "151001", "图片下载失败"),
    /**
     * 2-参数错误
     */
    MSG_152000(SYSTEM_CODE + "152000", "图片不能为空"),
    MSG_152001(SYSTEM_CODE + "152001", "图片格式不正确"),
    MSG_152002(SYSTEM_CODE + "152002", "组名称不能为空"),
    MSG_152003(SYSTEM_CODE + "152003", "远程图片路径不能为空"),
    MSG_152004(SYSTEM_CODE + "152004", "图片路径不能为空"),
    /**
     * 3-依赖基础服务错误
     */
    MSG_153000(SYSTEM_CODE + "153000", ""),
    /**
     * 4-业务错误
     */
    MSG_154000(SYSTEM_CODE + "154000", "fastdfs文件上传失败"),
    MSG_154001(SYSTEM_CODE + "154001", "fastdfs文件下载失败"),
    MSG_154002(SYSTEM_CODE + "144002", ""),
    MSG_154003(SYSTEM_CODE + "144003", ""),

    /******************************** ===  文件模块 (15)  end  === *******************************************/

    /******************************** ===  公告模块 (16) start  === ************************************/

    /**
     * 1-系统错误
     */
    MSG_161000(SYSTEM_CODE + "141000", ""),
    /**
     * 2-参数错误
     */
    MSG_162000(SYSTEM_CODE + "162000", "主键不能为空"),
    MSG_162001(SYSTEM_CODE + "162001", "名称不能为空"),
    MSG_162002(SYSTEM_CODE + "162002", "图片路径不能为空"),
    MSG_162003(SYSTEM_CODE + "162003", "重定向类型不能为空"),
    MSG_162004(SYSTEM_CODE + "162004", "重定地址不能为空"),
    MSG_162005(SYSTEM_CODE + "162005", "访问范围不能为空"),
    MSG_162006(SYSTEM_CODE + "162006", "上下架状态不能为空"),
    MSG_162007(SYSTEM_CODE + "162007", "位置不能为空"),
    MSG_162008(SYSTEM_CODE + "162008", "有效期状态不能为空"),
    MSG_162009(SYSTEM_CODE + "162009", "有效开始时间不能为空"),
    MSG_162010(SYSTEM_CODE + "162010", "有效结束时间不能为空"),
    MSG_162011(SYSTEM_CODE + "162011", "排序不能为空"),
    MSG_162012(SYSTEM_CODE + "162012", "内容不能为空"),
    MSG_162013(SYSTEM_CODE + "162013", "公告类型不能为空"),
    MSG_162014(SYSTEM_CODE + "162014", "编号不能为空"),
    MSG_162015(SYSTEM_CODE + "162015", "创建人不能为空"),
    MSG_162016(SYSTEM_CODE + "162016", "创建时间不能为空"),
    MSG_162017(SYSTEM_CODE + "162017", "修改人不能为空"),
    MSG_162018(SYSTEM_CODE + "162018", "修改时间不能为空"),
    MSG_162019(SYSTEM_CODE + "162019", "组织编号不能为空"),
    MSG_162020(SYSTEM_CODE + "162020", "摘要不能为空"),
    /**
     * 3-依赖基础服务错误
     */
    MSG_163000(SYSTEM_CODE + "163000", ""),
    /**
     * 4-业务错误
     */
    MSG_164000(SYSTEM_CODE + "164000", "记录不存在"),
    MSG_164001(SYSTEM_CODE + "164001", "组织用户记录不存在"),

    /******************************** ===  公告模块 (16)  end  === *******************************************/

    /******************************** ===  轮播图模块 (17) start  === ************************************/

    /**
     * 1-系统错误
     */
    MSG_171000(SYSTEM_CODE + "171000", ""),
    /**
     * 2-参数错误
     */
    MSG_172000(SYSTEM_CODE + "172000", "主键不能为空"),
    MSG_172001(SYSTEM_CODE + "172001", "名称不能为空"),
    MSG_172002(SYSTEM_CODE + "172002", "图片路径不能为空"),
    MSG_172003(SYSTEM_CODE + "172003", "重定向类型不能为空"),
    MSG_172004(SYSTEM_CODE + "172004", "重定地址不能为空"),
    MSG_172005(SYSTEM_CODE + "172005", "访问范围不能为空"),
    MSG_172006(SYSTEM_CODE + "172006", "上下架状态不能为空"),
    MSG_172007(SYSTEM_CODE + "172007", "位置不能为空"),
    MSG_172008(SYSTEM_CODE + "172008", "有效期状态不能为空"),
    MSG_172009(SYSTEM_CODE + "172009", "有效开始时间不能为空"),
    MSG_172010(SYSTEM_CODE + "172010", "有效结束时间不能为空"),
    MSG_172011(SYSTEM_CODE + "172011", "排序不能为空"),
    MSG_172012(SYSTEM_CODE + "172012", "编号不能为空"),
    MSG_172013(SYSTEM_CODE + "172013", "创建人不能为空"),
    MSG_172014(SYSTEM_CODE + "172014", "创建时间不能为空"),
    MSG_172015(SYSTEM_CODE + "172015", "修改人不能为空"),
    MSG_172016(SYSTEM_CODE + "172016", "修改时间不能为空"),
    /**
     * 3-依赖基础服务错误
     */
    MSG_173000(SYSTEM_CODE + "173000", ""),
    /**
     * 4-业务错误
     */
    MSG_174000(SYSTEM_CODE + "174000", "记录不存在"),

    /******************************** ===  轮播图模块 (17)  end  === *******************************************/

    /******************************** ===  验证码模块 (18) start  === ************************************/
    /**
     * 1-系统错误
     */
    MSG_181000(SYSTEM_CODE + "181000", ""),
    /**
     * 2-参数错误
     */
    MSG_182000(SYSTEM_CODE + "182000", "发送手机号码不能为空！"),
    /**
     * 3-依赖基础服务错误
     */
    MSG_183000(SYSTEM_CODE + "183000", ""),
    /**
     * 4-业务错误
     */
    MSG_184000(SYSTEM_CODE + "184000", "请一分钟后再发送验证码！"),
    MSG_184001(SYSTEM_CODE + "184001", "验证码已过期，请重新获取！"),
    MSG_184002(SYSTEM_CODE + "184002", "验证码错误！"),
    MSG_184003(SYSTEM_CODE + "184003", "验证码校验次数太多，请重新获取！"),
    /******************************** ===  验证码模块 (18) end  === ************************************/

    /******************************** ===  业主认证模块 (19) start  === ************************************/
    /**
     * 1-系统错误
     */
    MSG_191000(SYSTEM_CODE + "191000", ""),
    /**
     * 2-参数错误
     */
    MSG_192000(SYSTEM_CODE + "192000", "业主信息不存在"),
    MSG_192001(SYSTEM_CODE + "192001", "小区不能为空"),
    MSG_192002(SYSTEM_CODE + "192002", "业主姓名不能为空"),
    MSG_192003(SYSTEM_CODE + "192003", "本人姓名不能为空"),
    MSG_192004(SYSTEM_CODE + "192004", "房屋坐落不能为空"),
    MSG_192005(SYSTEM_CODE + "192005", "与业主关系不能为空"),
    MSG_192006(SYSTEM_CODE + "192006", "认证方式不能为空"),
    MSG_192007(SYSTEM_CODE + "192007", "认证材料不能为空"),
    MSG_192008(SYSTEM_CODE + "192008", "文本模板标识不能为空"),

    /**
     * 3-依赖基础服务错误
     */
    MSG_193000(SYSTEM_CODE + "193000", "文件查询失败"),
    MSG_193001(SYSTEM_CODE + "193001", "批量更新文件业务编号失败"),
    /**
     * 4-业务错误
     */
    MSG_194000(SYSTEM_CODE + "194000", "非待审核状态无法审核"),
    MSG_194001(SYSTEM_CODE + "194001", "审核备注不能为空"),
    MSG_194002(SYSTEM_CODE + "194002", "组织用户信息不存在"),
    MSG_194003(SYSTEM_CODE + "194003", ""),
    /******************************** ===  业主认证模块 (19) end  === ************************************/


    /******************************** ===  应用管理模块 (20) start  === ************************************/
    /**
     * 1-系统错误
     */
    MSG_201000(SYSTEM_CODE + "201000", ""),
    /**
     * 2-参数错误
     */
    MSG_202000(SYSTEM_CODE + "202000", "业主信息不存在"),
    /**
     * 3-依赖基础服务错误
     */
    MSG_203000(SYSTEM_CODE + "203000", ""),
    /**
     * 4-业务错误
     */
    MSG_204000(SYSTEM_CODE + "204000", "启用状态下，不可删除"),
    MSG_204001(SYSTEM_CODE + "204001", "组织内有上架应用，不可删除"),
    MSG_204002(SYSTEM_CODE + "204002", ""),
    MSG_204003(SYSTEM_CODE + "204003", ""),
    /******************************** ===  应用管理模块 (20) end  === ************************************/


    /****************************** === 栏目模块 start ===************************/
    MSG_304000(SYSTEM_CODE + "304000", "父级栏目模块不存在"),
    MSG_304001(SYSTEM_CODE + "304000", "栏目编码重复"),

    /****************************** === 栏目模块 end === ***********************/

    /****************************** === 地区 start ===************************/
    MSG_404000(SYSTEM_CODE + "404000", "地区不存在"),
    MSG_404001(SYSTEM_CODE + "404001", "组织所在地区信息不存在"),
    /****************************** === 地区 end === ***********************/

    /****************************** === 栏目模块 start ===************************/
    MSG_504000(SYSTEM_CODE + "504000", "组织或上级组织不存在"),
    MSG_504001(SYSTEM_CODE + "504001", "必须先设置该级别的所在的社区/小区"),
    MSG_504002(SYSTEM_CODE + "504002", "栏目内容不存在"),
    MSG_504003(SYSTEM_CODE + "504003", "栏目不存在");
    /****************************** === 栏目模块 end === ***********************/

    private String code;

    private String msg;

    MsgCode(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public String getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }

}